{
  "jobs": {
    "a1ceb896c8b2": {
      "id": "a1ceb896c8b2",
      "engine": "xtts",
      "chapter_file": "chapter_2221.txt",
      "status": "failed",
      "created_at": 1769699601.286746,
      "started_at": 1769699601.288357,
      "finished_at": 1769699700.3856142,
      "safe_mode": true,
      "make_mp3": true,
      "piper_voice": null,
      "output_wav": null,
      "output_mp3": null,
      "progress": 1.0,
      "eta_seconds": 235,
      "log": "/Users/stevendunn/xtts-env/lib/python3.11/site-packages/jieba/_compat.py:18: UserWarning: pkg_resources is deprecated as an API. See https://setuptools.pypa.io/en/latest/pkg_resources.html. The pkg_resources package is slated for removal as early as 2025-11-30. Refrain from using this package or pin to Setuptools<81.\n  import pkg_resources\n/Users/stevendunn/xtts-env/lib/python3.11/site-packages/TTS/tts/layers/xtts/xtts_manager.py:5: FutureWarning: You are using `torch.load` with `weights_only=False` (the current default value), which uses the default pickle module implicitly. It is possible to construct malicious pickle data which will execute arbitrary code during unpickling (See https://github.com/pytorch/pytorch/blob/main/SECURITY.md#untrusted-models for more details). In a future release, the default value for `weights_only` will be flipped to `True`. This limits the functions that could be executed during unpickling. Arbitrary objects will no longer be allowed to be loaded via this mode unless they are explicitly allowlisted by the user via `torch.serialization.add_safe_globals`. We recommend you start setting `weights_only=True` for any use case where you don't have full control of the loaded file. Please open an issue on GitHub for any issues related to this experimental feature.\n  self.speakers = torch.load(speaker_file_path)\n/Users/stevendunn/xtts-env/lib/python3.11/site-packages/TTS/utils/io.py:54: FutureWarning: You are using `torch.load` with `weights_only=False` (the current default value), which uses the default pickle module implicitly. It is possible to construct malicious pickle data which will execute arbitrary code during unpickling (See https://github.com/pytorch/pytorch/blob/main/SECURITY.md#untrusted-models for more details). In a future release, the default value for `weights_only` will be flipped to `True`. This limits the functions that could be executed during unpickling. Arbitrary objects will no longer be allowed to be loaded via this mode unless they are explicitly allowlisted by the user via `torch.serialization.add_safe_globals`. We recommend you start setting `weights_only=True` for any use case where you don't have full control of the loaded file. Please open an issue on GitHub for any issues related to this experimental feature.\n  return torch.load(f, map_location=map_location, **kwargs)\n > tts_models/multilingual/multi-dataset/xtts_v2 is already downloaded.\n > Using model: xtts\n > Text: Chapter 2221: Dark Guide The journey across the crumbling hellscape of the battlefield had been a perilous nightmare. Sunny and Nightmare cleaved into the mass of Nightmare Creatures, besieged from all sides by the frenzied avalanche of abominations. Crimson blood and scarlet sap spilled on the white bone, and mangled bodies toppled to the ground… They were swiftly swallowed by the red sea of spreading moss, only to rise again moments later. Even locked in a furious battle with the King of Swords, the Queen did not miss the chance to create new puppets. Sunny opened a gap in the tide of monsters, and the Sword Army followed the dark rider. However, the horrors of the liberated jungle were not the only danger facing the soldiers — there was the army of puppets and the devastating hurricane of flying swords, as well. He had to find a path through the cataclysmic battle of the two Domains , avoiding the wider cracks that marred the surface of the fractured plain. , the flashpoint in the obliterating confrontation between Ki Song’s puppets and Anvil’s swords , and the caged Titans. Even if he did, the danger still remained — at any moment, the two Sovereigns could plummet from the sky, causing a violent detonation on the ground. If the army was caught in that violent explosion of annihilating forces, the casualties were going to be horrific… the Saints would probably survive, and some of the Masters too. But the Awakened soldiers would become a cloud of crimson haze. ‘What a mess Sunny used his spear and manifested shadows to slaughter frenzied abominations. Nightmare used his fangs, his horns, and his hooves to furiously rip them apart. The aura of dread surrounding the black steed weakened the hungry Nightmare Creatures, which made the two of them even more deadly than they already were. Far behind, Sunny’s other incarnations were struggling to preserve the fragile formation of the advancing army side by side with other Saints of the Sword Domain. One of his avatars was protecting the rear, one was fighting on the right flank, and one was fighting on the left. Saint and Fiend were holding back the flood of Nightmare Creatures , as well… Nephis and her miraculous flames were at the head of the army. , continuously healing the soldiers and following the path that he had carved. Somehow, unbelievably… they made it quite far. The casualties were heavy , and the formation of the Sword Army had turned into a complete mess. , all pretenses of order obliterated by the carnage of the great battle and the complicated terrain of the fractured plain. But they still managed to torturously extricate themselves from the worst of the scarlet flood and made it to the epicenter of the clash between the dead army and the storm of swords. That was perhaps even more dangerous than being surrounded by a sea of frenzied Nightmare Creatures. Neither the puppets nor the flying swords were hostile to the human soldiers — however, they did not seem concerned about collateral damage, either. There were cracks leading to the Hollows here , as well , and the jungle was attempting to escape to the surface from them. , too… but most of the horrors that escaped the darkness were swiftly obliterated by the violent aftershocks of the harrowing battle between the two Sovereigns. The army was only actively besieged from the rear now — liberated from the dire need to fight the Nightmare Creatures , it closed ranks and concentrated on defense. , the officers exerting their Aspect powers to protect the Awakened soldiers from the chaos , the mayhem , the destructive shockwaves of distant collisions , and the rustling streams of stray swords. Success… was limited, at best. The ground was still quaking, the deafening cacophony of the battle was still unbearable, and the world still resembled a crumbling hell. In fact , now that the soldiers were not just witnessing the clash between the Supremes , but were in the midst of it , the chilling catastrophe of their clash had only become harder to conceive of. , fathom , and endure. But they did endure. Even then, it was in no small part thanks to Sunny. He had not volunteered to become a guide for the reeling Sword Army merely because of how strong he was, and how fearsome his steed was. Rather, he was the best man for the job because his shadow sense was able to envelop the entire battlefield. Therefore, Sunny knew where to go, what path to choose, and which directions to steer clear of in order to avoid complete annihilation. The battered army slowly advanced through the carnage. All pretenses of maintaining an orderly formation had long been abandoned, and by now, it was nothing more than a vast mob… however, it was a mob of seasoned warriors, not panicking civilians. Faced with a horror too great to be fathomed, the soldiers had simply abandoned fear, somberly concentrating on the task at hand instead and refusing to think about anything else. Perhaps that was why they had survived. ‘I… need to hurry Sunny was concerned about the Song Army, as well. After all, Rain was there. Cassie was there, too, bound by the invisible strings of the Queen’s power. As he was carving a blood path through the mayhem atop Nightmare and fighting to defend the splintering Sword Army, he was also tensely observing Rain. In the end, Sunny had no choice but to emerge from her shadow and reveal himself among the soldiers of Song for the first time since his sister had become one of them. Almost at the same time, he finally broke through the tide of abominations and came in view of the battered expanse of the Queen’s soldiers. He regarded them for a moment from Nightmare’s back, streams of blood running down the onyx surface of the Mantle. The sight of him sitting atop Nightmare must have been quite terrifying. The Song Army had done better than the warriors of the Sword Domain, but they too were on the verge of drowning in the scarlet flood. Neither of the sides were going to weather the calamity alone… Truthfully, even if they joined forces, their chances were not great. But wasn’t it funny? These people had been ready to kill each other not too long ago, but now, their best chance to survive was to fight side by side with each other. ‘I can’t tell if that is poetic or ironic Perhaps it was both. Somewhere behind, the vague silhouette of the Ivory Island revealed itself from the storm of swords, looming above the Sword Army as if trying to shield it from the fury of the Supreme battle above. Raising his spear, Sunny leaned forward and tossed it at the soldiers of Song. They did not even have time to react. Tearing the air, the dark spear instantly breached the remaining distance… And nailed a monstrous spider that had been lunging at Seishan to the ground. Spinning swiftly, she spent a split second to stare at the spider, then turned her head and looked at Sunny. He met her gaze coldly, remained motionless for a moment… and then gave her an exaggerated bow. Behind him, the banners of the Sword Army fluttered in the hurricane wind.\n > Text splitted to sentences.\n['Chapter 2221: Dark Guide The journey across the crumbling hellscape of the battlefield had been a perilous nightmare.', 'Sunny and Nightmare cleaved into the mass of Nightmare Creatures, besieged from all sides by the frenzied avalanche of abominations.', 'Crimson blood and scarlet sap spilled on the white bone, and mangled bodies toppled to the ground… They were swiftly swallowed by the red sea of spreading moss, only to rise again moments later.', 'Even locked in a furious battle with the King of Swords, the Queen did not miss the chance to create new puppets.', 'Sunny opened a gap in the tide of monsters, and the Sword Army followed the dark rider.', 'However, the horrors of the liberated jungle were not the only danger facing the soldiers — there was the army of puppets and the devastating hurricane of flying swords, as well.', 'He had to find a path through the cataclysmic battle of the two Domains , avoiding the wider cracks that marred the surface of the fractured plain.', ', the flashpoint in the obliterating confrontation between Ki Song’s puppets and Anvil’s swords , and the caged Titans.', 'Even if he did, the danger still remained — at any moment, the two Sovereigns could plummet from the sky, causing a violent detonation on the ground.', 'If the army was caught in that violent explosion of annihilating forces, the casualties were going to be horrific… the Saints would probably survive, and some of the Masters too.', 'But the Awakened soldiers would become a cloud of crimson haze.', '‘What a mess Sunny used his spear and manifested shadows to slaughter frenzied abominations. Nightmare used his fangs, his horns, and his hooves to furiously rip them apart. The aura of dread surrounding the black steed weakened the hungry Nightmare Creatures, which made the two of them even more deadly than they already were. Far behind, Sunny’s other incarnations were struggling to preserve the fragile formation of the advancing army side by side with other Saints of the Sword Domain. One of his avatars was protecting the rear, one was fighting on the right flank, and one was fighting on the left. Saint and Fiend were holding back the flood of Nightmare Creatures , as well… Nephis and her miraculous flames were at the head of the army. , continuously healing the soldiers and following the path that he had carved. Somehow, unbelievably… they made it quite far. The casualties were heavy , and the formation of the Sword Army had turned into a complete mess. , all pretenses of order obliterated by the carnage of the great battle and the complicated terrain of the fractured plain. But they still managed to torturously extricate themselves from the worst of the scarlet flood and made it to the epicenter of the clash between the dead army and the storm of swords. That was perhaps even more dangerous than being surrounded by a sea of frenzied Nightmare Creatures. Neither the puppets nor the flying swords were hostile to the human soldiers — however, they did not seem concerned about collateral damage, either. There were cracks leading to the Hollows here , as well , and the jungle was attempting to escape to the surface from them. , too… but most of the horrors that escaped the darkness were swiftly obliterated by the violent aftershocks of the harrowing battle between the two Sovereigns. The army was only actively besieged from the rear now — liberated from the dire need to fight the Nightmare Creatures , it closed ranks and concentrated on defense. , the officers exerting their Aspect powers to protect the Awakened soldiers from the chaos , the mayhem , the destructive shockwaves of distant collisions , and the rustling streams of stray swords. Success… was limited, at best. The ground was still quaking, the deafening cacophony of the battle was still unbearable, and the world still resembled a crumbling hell. In fact , now that the soldiers were not just witnessing the clash between the Supremes , but were in the midst of it , the chilling catastrophe of their clash had only become harder to conceive of. , fathom , and endure. But they did endure. Even then, it was in no small part thanks to Sunny. He had not volunteered to become a guide for the reeling Sword Army merely because of how strong he was, and how fearsome his steed was. Rather, he was the best man for the job because his shadow sense was able to envelop the entire battlefield. Therefore, Sunny knew where to go, what path to choose, and which directions to steer clear of in order to avoid complete annihilation. The battered army slowly advanced through the carnage. All pretenses of maintaining an orderly formation had long been abandoned, and by now, it was nothing more than a vast mob… however, it was a mob of seasoned warriors, not panicking civilians. Faced with a horror too great to be fathomed, the soldiers had simply abandoned fear, somberly concentrating on the task at hand instead and refusing to think about anything else. Perhaps that was why they had survived. ‘I… need to hurry Sunny was concerned about the Song Army, as well. After all, Rain was there. Cassie was there, too, bound by the invisible strings of the Queen’s power. As he was carving a blood path through the mayhem atop Nightmare and fighting to defend the splintering Sword Army, he was also tensely observing Rain. In the end, Sunny had no choice but to emerge from her shadow and reveal himself among the soldiers of Song for the first time since his sister had become one of them. Almost at the same time, he finally broke through the tide of abominations and came in view of the battered expanse of the Queen’s soldiers. He regarded them for a moment from Nightmare’s back, streams of blood running down the onyx surface of the Mantle. The sight of him sitting atop Nightmare must have been quite terrifying. The Song Army had done better than the warriors of the Sword Domain, but they too were on the verge of drowning in the scarlet flood. Neither of the sides were going to weather the calamity alone… Truthfully, even if they joined forces, their chances were not great. But wasn’t it funny? These people had been ready to kill each other not too long ago, but now, their best chance to survive was to fight side by side with each other. ‘I can’t tell if that is poetic or ironic Perhaps it was both.', 'Somewhere behind, the vague silhouette of the Ivory Island revealed itself from the storm of swords, looming above the Sword Army as if trying to shield it from the fury of the Supreme battle above.', 'Raising his spear, Sunny leaned forward and tossed it at the soldiers of Song.', 'They did not even have time to react.', 'Tearing the air, the dark spear instantly breached the remaining distance… And nailed a monstrous spider that had been lunging at Seishan to the ground.', 'Spinning swiftly, she spent a split second to stare at the spider, then turned her head and looked at Sunny.', 'He met her gaze coldly, remained motionless for a moment… and then gave her an exaggerated bow.', 'Behind him, the banners of the Sword Army fluttered in the hurricane wind.']\n[!] Warning: The text length exceeds the character limit of 250 for language 'en', this might cause truncated audio.\nTraceback (most recent call last):\n  File \"/Users/stevendunn/xtts-env/bin/tts\", line 7, in <module>\n    sys.exit(main())\n             ^^^^^^\n  File \"/Users/stevendunn/xtts-env/lib/python3.11/site-packages/TTS/bin/synthesize.py\", line 484, in main\n    wav = synthesizer.tts(\n          ^^^^^^^^^^^^^^^^\n  File \"/Users/stevendunn/xtts-env/lib/python3.11/site-packages/TTS/utils/synthesizer.py\", line 386, in tts\n    outputs = self.tts_model.synthesize(\n              ^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"/Users/stevendunn/xtts-env/lib/python3.11/site-packages/TTS/tts/models/xtts.py\", line 419, in synthesize\n    return self.full_inference(text, speaker_wav, language, **settings)\n           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"/Users/stevendunn/xtts-env/lib/python3.11/site-packages/torch/utils/_contextlib.py\", line 116, in decorate_context\n    return func(*args, **kwargs)\n           ^^^^^^^^^^^^^^^^^^^^^\n  File \"/Users/stevendunn/xtts-env/lib/python3.11/site-packages/TTS/tts/models/xtts.py\", line 488, in full_inference\n    return self.inference(\n           ^^^^^^^^^^^^^^^\n  File \"/Users/stevendunn/xtts-env/lib/python3.11/site-packages/torch/utils/_contextlib.py\", line 116, in decorate_context\n    return func(*args, **kwargs)\n           ^^^^^^^^^^^^^^^^^^^^^\n  File \"/Users/stevendunn/xtts-env/lib/python3.11/site-packages/TTS/tts/models/xtts.py\", line 537, in inference\n    text_tokens.shape[-1] < self.args.gpt_max_text_tokens\nAssertionError:  ❗ XTTS can only generate text with a maximum of 400 tokens.\n",
      "error": "Generation failed (rc=1)."
    },
    "27dc2f57b3cf": {
      "id": "27dc2f57b3cf",
      "engine": "xtts",
      "chapter_file": "chapter_2256.txt",
      "status": "failed",
      "created_at": 1769699601.289595,
      "started_at": 1769699700.386077,
      "finished_at": 1769699985.486408,
      "safe_mode": true,
      "make_mp3": true,
      "piper_voice": null,
      "output_wav": null,
      "output_mp3": null,
      "progress": 1.0,
      "eta_seconds": 201,
      "log": "/Users/stevendunn/xtts-env/lib/python3.11/site-packages/jieba/_compat.py:18: UserWarning: pkg_resources is deprecated as an API. See https://setuptools.pypa.io/en/latest/pkg_resources.html. The pkg_resources package is slated for removal as early as 2025-11-30. Refrain from using this package or pin to Setuptools<81.\n  import pkg_resources\n/Users/stevendunn/xtts-env/lib/python3.11/site-packages/TTS/tts/layers/xtts/xtts_manager.py:5: FutureWarning: You are using `torch.load` with `weights_only=False` (the current default value), which uses the default pickle module implicitly. It is possible to construct malicious pickle data which will execute arbitrary code during unpickling (See https://github.com/pytorch/pytorch/blob/main/SECURITY.md#untrusted-models for more details). In a future release, the default value for `weights_only` will be flipped to `True`. This limits the functions that could be executed during unpickling. Arbitrary objects will no longer be allowed to be loaded via this mode unless they are explicitly allowlisted by the user via `torch.serialization.add_safe_globals`. We recommend you start setting `weights_only=True` for any use case where you don't have full control of the loaded file. Please open an issue on GitHub for any issues related to this experimental feature.\n  self.speakers = torch.load(speaker_file_path)\n/Users/stevendunn/xtts-env/lib/python3.11/site-packages/TTS/utils/io.py:54: FutureWarning: You are using `torch.load` with `weights_only=False` (the current default value), which uses the default pickle module implicitly. It is possible to construct malicious pickle data which will execute arbitrary code during unpickling (See https://github.com/pytorch/pytorch/blob/main/SECURITY.md#untrusted-models for more details). In a future release, the default value for `weights_only` will be flipped to `True`. This limits the functions that could be executed during unpickling. Arbitrary objects will no longer be allowed to be loaded via this mode unless they are explicitly allowlisted by the user via `torch.serialization.add_safe_globals`. We recommend you start setting `weights_only=True` for any use case where you don't have full control of the loaded file. Please open an issue on GitHub for any issues related to this experimental feature.\n  return torch.load(f, map_location=map_location, **kwargs)\n > tts_models/multilingual/multi-dataset/xtts_v2 is already downloaded.\n > Using model: xtts\n > Text: Chapter 2256: Abominable Curse \"...She is complete.\" Sunny traced Anvil's gaze and remained motionless for a few moments , looking at the towering figure of the Queen's vessel. , which was enveloped by white flame like a gargantuan pyre. Her dead flesh was burning. Sunny's pale face was illuminated by the distant light of Neph's Transcendent form. Looking at her, he took a deep breath and forced his murderous anger to subside. His expression turned cold and somber. Glancing at Anvil, he remained silent for a bit, and then said with a hint of disdain in his voice: \"You see, this is your root problem. A failure of imagination — or ambition, perhaps.\" Taking a step forward, Sunny pressed the tip of his odachi against Anvil's neck. \"Nephis? Complete? She is not complete, Anvil… she won't be complete until she becomes Divine. Unlike you and the other two ghouls, she will not surrender until she conquers the Nightmare Spell entirely. That, in the end, is your sin. That is the reason why you don't deserve to sit on the throne of humanity, and she does. That is why you must die.\" Anvil glanced at him with a dark smile. \"Funny, isn't it?\" Sunny's expression grew colder. \"And what, exactly, do you find so funny?\" Anvil shrugged. \"She is just like her father, in that regard. Ah… but I think that she resembles her mother much more, instead.\" Sunny took a deep breath, holding himself back. There was a reason why he was wasting time conversing with Anvil instead of simply finishing him off, of course. It was not because Sunny had suddenly developed a fondness for villainous monologues… although he would lie if he said that giving Anvil a piece of his mind had not felt good. No, it was because Sunny had to get something out of Anvil before the King of Swords met an ignoble end. There was something he had to know. He exhaled slowly. \"Right… you bastards killed Broken Sword, as well. Was that also for the greater good?\" Anvil's eyes darkened. \"You should know by now why he had to die,Lord of Shadows. All of this could have been avoided if not for that selfish man's folly.\" Sunny smiled faintly, suppressing the desire to cut off the King's self-righteous head. Controlling his expression, he said: \"Enlighten me.\" Anvil let out a sigh and calmly looked Sunny in the eye. \"It was because he absorbed Weaver's forbidden Lineage, of course. Our hands were tied the moment he did.\" Sunny allowed himself to frown slightly, pretending to be clueless. As far as everyone was concerned — even Cassie and Nephis — he was the heir of Shadow God. No one knew that Weaver's blood flowed in his veins, instead. Anvil would not know, either. He raised an eyebrow and asked, hiding how vital knowing the answer to that question was to him: \"And why was that so important? What was it about Weaver's lineage that made you betray your comrade? To kill your own leader?\" Anvil smiled coldly. \"Children… you don't know anything, do you? Well, no surprise. Some things are not meant to be known by mere mortals.\" As the hurricane of swords above them shifted , numerous blades changing direction. , he leaned forward a little and asked: \"Why did Broken Sword have to die?. Let me ask you a question instead, Lord of Shadows… have you ever been to the Chained Isles? You should have. Why did the gods destroy Hope's kingdom and imprison her in the Ivory Tower?\" This time, Sunny's frown was genuine. He hesitated for a few moments, and then responded in a subdued voice: \"Because daemons… were their Flaw.\" Anvil chuckled. \"Indeed, daemons were the Flaw of the gods. Because daemons were children of the Forgotten God.\" Sunny drew a breath as Anvil shook his head and continued: \"And yet, the gods did not punish and imprison all seven daemons. Only Hope. Why was that?\" Sunny hesitated with the answer. \"I'm not sure. I heard once… that it was because she was the only daemon who was worshiped by humans.\" Anvil looked at him with a grim resignation and nodded. , not paying attention to the blade of the odachi that had cut into his neck. \"Yes. It was because Hope was the only daemon who was benevolent toward humans, those who carried the sparks of the original Desire. She came to live among them, cared for them, and bestowed gifts upon them. As a result, she was beloved by humans… worshiped by them.\" His voice turned heavy and dark: \"But she was a daughter of the Forgotten God. She carried the Lineage of the Forgotten God. And therefore, everyone who worshiped her… was worshiping the Forgotten God. Was propagating his name, his divinity, and his power. And the more they did…\" Sunny's eyes widened slowly, but Anvil did not seem to notice, continuing in the same stark tone: \"The more he stirred in his slumber, coming closer and closer to awakening. That was why the gods destroyed the Kingdom of Hope and imprisoned her. That was why they had forbidden the daemons from siring offspring, as well. And that is why Weaver's Lineage, created in secret, is an abominable curse that should never have existed.\" He gritted his teeth. \"The Forgotten God is closer to awakening today than he has ever been. Now, then… imagine if Broken Sword — the most revered hero of humanity — was allowed to build a vast and powerful Domain while carrying that abominable curse. How many humans would have known him, loved him, and worshiped him? What would have happened then?\" Sunny shivered, feeling his mind go blank for a moment. He did not know what to answer… he did not want to know the answer. He would not have answered if not for the pain of his Flaw, which forced him to be honest even if he wished to deceive himself. Feeling something cold permeate his chest, he said slowly: \"The Forgotten God… would have grown more aware of reality. Or maybe even awakened from his slumber completely.\" Hearing his words, Anvil smiled darkly. \"Yes. Now, you know... that is why we killed Broken Sword. Because an heir of Weaver must never be known, must never be loved, and must never be worshiped by humanity.\"\n > Text splitted to sentences.\n['Chapter 2256: Abominable Curse \"...She is complete.\"', \"Sunny traced Anvil's gaze and remained motionless for a few moments , looking at the towering figure of the Queen's vessel.\", ', which was enveloped by white flame like a gargantuan pyre.', 'Her dead flesh was burning.', \"Sunny's pale face was illuminated by the distant light of Neph's Transcendent form.\", 'Looking at her, he took a deep breath and forced his murderous anger to subside.', 'His expression turned cold and somber.', 'Glancing at Anvil, he remained silent for a bit, and then said with a hint of disdain in his voice: \"You see, this is your root problem. A failure of imagination — or ambition, perhaps.\"', \"Taking a step forward, Sunny pressed the tip of his odachi against Anvil's neck.\", '\"Nephis? Complete? She is not complete, Anvil… she won\\'t be complete until she becomes Divine. Unlike you and the other two ghouls, she will not surrender until she conquers the Nightmare Spell entirely. That, in the end, is your sin. That is the reason why you don\\'t deserve to sit on the throne of humanity, and she does. That is why you must die.\"', 'Anvil glanced at him with a dark smile.', '\"Funny, isn\\'t it?\"', \"Sunny's expression grew colder.\", '\"And what, exactly, do you find so funny?\"', 'Anvil shrugged.', '\"She is just like her father, in that regard. Ah… but I think that she resembles her mother much more, instead.\"', 'Sunny took a deep breath, holding himself back.', 'There was a reason why he was wasting time conversing with Anvil instead of simply finishing him off, of course.', 'It was not because Sunny had suddenly developed a fondness for villainous monologues… although he would lie if he said that giving Anvil a piece of his mind had not felt good.', 'No, it was because Sunny had to get something out of Anvil before the King of Swords met an ignoble end.', 'There was something he had to know.', 'He exhaled slowly.', '\"Right… you bastards killed Broken Sword, as well. Was that also for the greater good?\"', \"Anvil's eyes darkened.\", '\"You should know by now why he had to die,Lord of Shadows. All of this could have been avoided if not for that selfish man\\'s folly.\"', \"Sunny smiled faintly, suppressing the desire to cut off the King's self-righteous head.\", 'Controlling his expression, he said: \"Enlighten me.\"', 'Anvil let out a sigh and calmly looked Sunny in the eye.', '\"It was because he absorbed Weaver\\'s forbidden Lineage, of course. Our hands were tied the moment he did.\"', 'Sunny allowed himself to frown slightly, pretending to be clueless.', 'As far as everyone was concerned — even Cassie and Nephis — he was the heir of Shadow God.', \"No one knew that Weaver's blood flowed in his veins, instead.\", 'Anvil would not know, either.', 'He raised an eyebrow and asked, hiding how vital knowing the answer to that question was to him: \"And why was that so important? What was it about Weaver\\'s lineage that made you betray your comrade? To kill your own leader?\"', 'Anvil smiled coldly.', '\"Children… you don\\'t know anything, do you? Well, no surprise. Some things are not meant to be known by mere mortals.\"', 'As the hurricane of swords above them shifted , numerous blades changing direction.', ', he leaned forward a little and asked: \"Why did Broken Sword have to die?. Let me ask you a question instead, Lord of Shadows… have you ever been to the Chained Isles? You should have. Why did the gods destroy Hope\\'s kingdom and imprison her in the Ivory Tower?\"', \"This time, Sunny's frown was genuine.\", 'He hesitated for a few moments, and then responded in a subdued voice: \"Because daemons… were their Flaw.\"', 'Anvil chuckled.', '\"Indeed, daemons were the Flaw of the gods. Because daemons were children of the Forgotten God.\"', 'Sunny drew a breath as Anvil shook his head and continued: \"And yet, the gods did not punish and imprison all seven daemons. Only Hope. Why was that?\"', 'Sunny hesitated with the answer.', '\"I\\'m not sure. I heard once… that it was because she was the only daemon who was worshiped by humans.\"', 'Anvil looked at him with a grim resignation and nodded.', ', not paying attention to the blade of the odachi that had cut into his neck.', '\"Yes. It was because Hope was the only daemon who was benevolent toward humans, those who carried the sparks of the original Desire. She came to live among them, cared for them, and bestowed gifts upon them. As a result, she was beloved by humans… worshiped by them.\"', 'His voice turned heavy and dark: \"But she was a daughter of the Forgotten God. She carried the Lineage of the Forgotten God. And therefore, everyone who worshiped her… was worshiping the Forgotten God. Was propagating his name, his divinity, and his power. And the more they did…\" Sunny\\'s eyes widened slowly, but Anvil did not seem to notice, continuing in the same stark tone: \"The more he stirred in his slumber, coming closer and closer to awakening. That was why the gods destroyed the Kingdom of Hope and imprisoned her. That was why they had forbidden the daemons from siring offspring, as well. And that is why Weaver\\'s Lineage, created in secret, is an abominable curse that should never have existed.\"', 'He gritted his teeth.', '\"The Forgotten God is closer to awakening today than he has ever been. Now, then… imagine if Broken Sword — the most revered hero of humanity — was allowed to build a vast and powerful Domain while carrying that abominable curse. How many humans would have known him, loved him, and worshiped him? What would have happened then?\"', 'Sunny shivered, feeling his mind go blank for a moment.', 'He did not know what to answer… he did not want to know the answer.', 'He would not have answered if not for the pain of his Flaw, which forced him to be honest even if he wished to deceive himself.', 'Feeling something cold permeate his chest, he said slowly: \"The Forgotten God… would have grown more aware of reality. Or maybe even awakened from his slumber completely.\"', 'Hearing his words, Anvil smiled darkly.', '\"Yes. Now, you know... that is why we killed Broken Sword. Because an heir of Weaver must never be known, must never be loved, and must never be worshiped by humanity.\"']\n[!] Warning: The text length exceeds the character limit of 250 for language 'en', this might cause truncated audio.\n[!] Warning: The text length exceeds the character limit of 250 for language 'en', this might cause truncated audio.\n[!] Warning: The text length exceeds the character limit of 250 for language 'en', this might cause truncated audio.\n[!] Warning: The text length exceeds the character limit of 250 for language 'en', this might cause truncated audio.\nTraceback (most recent call last):\n  File \"/Users/stevendunn/xtts-env/bin/tts\", line 7, in <module>\n    sys.exit(main())\n             ^^^^^^\n  File \"/Users/stevendunn/xtts-env/lib/python3.11/site-packages/TTS/bin/synthesize.py\", line 484, in main\n    wav = synthesizer.tts(\n          ^^^^^^^^^^^^^^^^\n  File \"/Users/stevendunn/xtts-env/lib/python3.11/site-packages/TTS/utils/synthesizer.py\", line 386, in tts\n    outputs = self.tts_model.synthesize(\n              ^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"/Users/stevendunn/xtts-env/lib/python3.11/site-packages/TTS/tts/models/xtts.py\", line 419, in synthesize\n    return self.full_inference(text, speaker_wav, language, **settings)\n           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"/Users/stevendunn/xtts-env/lib/python3.11/site-packages/torch/utils/_contextlib.py\", line 116, in decorate_context\n    return func(*args, **kwargs)\n           ^^^^^^^^^^^^^^^^^^^^^\n  File \"/Users/stevendunn/xtts-env/lib/python3.11/site-packages/TTS/tts/models/xtts.py\", line 488, in full_inference\n    return self.inference(\n           ^^^^^^^^^^^^^^^\n  File \"/Users/stevendunn/xtts-env/lib/python3.11/site-packages/torch/utils/_contextlib.py\", line 116, in decorate_context\n    return func(*args, **kwargs)\n           ^^^^^^^^^^^^^^^^^^^^^\n  File \"/Users/stevendunn/xtts-env/lib/python3.11/site-packages/TTS/tts/models/xtts.py\", line 537, in inference\n    text_tokens.shape[-1] < self.args.gpt_max_text_tokens\nAssertionError:  ❗ XTTS can only generate text with a maximum of 400 tokens.\n",
      "error": "Generation failed (rc=1)."
    }
  },
  "settings": {
    "safe_mode": true,
    "make_mp3": true,
    "default_engine": "xtts",
    "default_piper_voice": null
  }
}